R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
		#if ((DEVICE_FLASH_TOTAL_SIZE) >= (1024UL * 1024UL))
		{.secIndex = 8,  .secStartAddr = FLASH_BASE + 0x80000, .secSize = CUS_FLASH_SECTOR_128K},
		{.secIndex = 9,  .secStartAddr = FLASH_BASE + 0xA0000, .secSize = CUS_FLASH_SECTOR_128K},
		{.secIndex = 10, .secStartAddr = FLASH_BASE + 0xC0000, .secSize = CUS_FLASH_SECTOR_128K},
		{.secIndex = 11, .secStartAddr = FLASH_BASE + 0xE0000, .secSize = CUS_FLASH_SECTOR_128K},
		#endif /* 1MB FLASH. */

		#if ((DEVICE_FLASH_TOTAL_SIZE) >= (2048UL * 1024UL))
		/* BANK2. Refer BANK1. */
		{.secIndex = 12, .secStartAddr = FLASH_BASE + 0x100000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 0000
		{.secIndex = 13, .secStartAddr = FLASH_BASE + 0x104000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 4000
		{.secIndex = 14, .secStartAddr = FLASH_BASE + 0x108000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 8000
		{.secIndex = 15, .secStartAddr = FLASH_BASE + 0x10C000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 C000
		{.secIndex = 16, .secStartAddr = FLASH_BASE + 0x110000, .secSize = CUS_FLASH_SECTOR_64K},  // 0x0811 0000
		{.secIndex = 17, .secStartAddr = FLASH_BASE + 0x120000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0812 0000
		{.secIndex = 18, .secStartAddr = FLASH_BASE + 0x140000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0814 0000
		{.secIndex = 19, .secStartAddr = FLASH_BASE + 0x160000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0816 0000
		{.secIndex = 20, .secStartAddr = FLASH_BASE + 0x180000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0818 0000
		{.secIndex = 21, .secStartAddr = FLASH_BASE + 0x1A0000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x081A 0000
		{.secIndex = 22, .secStartAddr = FLASH_BASE + 0x1C0000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x081C 0000
		{.secIndex = 23, .secStartAddr = FLASH_BASE + 0x1E0000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x081E 0000
		#endif /* 2MB FLASH. */
	};

	static const uint8_t gsc_secTotalCount = (sizeof(SectorTable) / sizeof(SectorTable[0]));

#endif /* (FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx) */

/* PVD Flag. */
static volatile uint8_t gs_lowVoltage;

/* ****************************************************** */

static inline void 
__enter_critical( void )
{
	#if (CUS_FLASH_USE_SYS)
		CUS_FLASH_ENTER_CRITICAL();
	#else 
		__nop();
	#endif /* CUS_FLASH_USE_SYS */
}



static inline void 
__exit_critical( void )
{
	#if (CUS_FLASH_USE_SYS)
		CUS_FLASH_EXIT_CRITICAL();
	#else 
		__nop();
	#endif /* CUS_FLASH_USE_SYS */
}



static inline bool 
__sys_takeSemaphore( void )
{
	#if (CUS_FLASH_USE_SYS)
		bool isLock = Cus_Flash_SYS_Lock();
		return isLock;
	#else 
		return true;
	#endif /* CUS_FLASH_USE_SYS */
}



static inline void 
__sys_giveSemaphore( void )
{
	#if (CUS_FLASH_USE_SYS)
		Cus_Flash_SYS_Unlock();
	#else 
		__nop();
	#endif /* CUS_FLASH_USE_SYS */
}



void 
Cus_Flash_Lock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) != 0 )    return;   /* Has already be locked. Return. */

	uint32_t start = CUS_FLASH_GET_TICK();
	while( FLASH->SR & FLASH_SR_BSY_Msk )
	{
		if ( (CUS_FLASH_GET_TICK() - start) >= 100 ) break;
		__nop();
	}
	if ( FLASH->SR & FLASH_SR_BSY_Msk )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_LockFailed_Hook();
		return;
	}

	/* FLASH_CR Lock bit set. */
	FLASH->CR |= FLASH_CR_LOCK_Msk;

	FLASH_CR_RegTemp = FLASH->CR;
	if ( !(FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )
	{
		/* Lock failed! FLASH_CR Lock bit still reset.(write/read-back dismatch!) */
		Cus_FLASH_LockFailed_Hook();
	}
}



void 
Cus_Flash_Unlock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) == 0 )  return;   /* Has already be unlocked. Return. */

	uint32_t start = CUS_FLASH_GET_TICK();
	while( FLASH->SR & FLASH_SR_BSY_Msk )
	{
		if ( (CUS_FLASH_GET_TICK() - start) >= 100 ) break;
		__nop();
	}
	if ( FLASH->SR & FLASH_SR_BSY_Msk )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_UnlockFailed_Hook();
		return;
	}

	/* Start Flash unlock sequence by writing KEY1 to FLASH_KEYR. */ 
	__enter_critical();
	FLASH->KEYR = FLASH_KEYR_KEY1;    
	__DSB();

	/* Writing the last KEY Code(KEY2) to FLASH_KEYR. */
	FLASH->KEYR = FLASH_KEYR_KEY2;    
	__exit_critical();

	FLASH_CR_RegTemp = FLASH->CR;
	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )   
	{
		/* Unlock failed! FLASH_CR Lock bit still set. (write/read-back dismatch!) */
		Cus_FLASH_UnlockFailed_Hook();
	}
}



bool 
Cus_Flash_CalibrateLatency( void )
{
	SystemCoreClockUpdate();
	uint32_t desire_Latancy = ((FLASH->ACR) & 0x07UL);

	#if (DEVICE_STM32F1xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_24Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else  desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_24Mhz) && (SystemCoreClock <= SYSTEMCLOCK_48Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_48Mhz) && (SystemCoreClock <= SYSTEMCLOCK_72Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else 
		{
			return false;               // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F1xx

	#if (DEVICE_STM32F4xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_30Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_30Mhz) && (SystemCoreClock <= SYSTEMCLOCK_60Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_60Mhz) && (SystemCoreClock <= SYSTEMCLOCK_90Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_90Mhz) && (SystemCoreClock <= SYSTEMCLOCK_120Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 1) | 0x01UL;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_120Mhz) && (SystemCoreClock <= SYSTEMCLOCK_150Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) )  return true;
			else desire_Latancy = ((0x01UL) << 2);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_150Mhz) && (SystemCoreClock <= SYSTEMCLOCK_168Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 2) | 0x01UL;
		}
		else 
		{
			return false;       // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F4xx

