R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	FLASH->ACR = (FLASH->ACR & ~0x07UL) | desire_Latancy;

	return ((FLASH->ACR & 0x07UL) == desire_Latancy);
}



uint32_t 
Cus_Flash_SYS_GetTick( void )
{
	return DWT->CYCCNT / gs_dwtTickPerMs;
}



void Cus_Flash_SYS_TickInit( void )
{
	/* Init DWT cycle counter for CUS_FLASH_GET_TICK default. */
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CYCCNT = 0;
	DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;
	gs_dwtTickPerMs = SystemCoreClock / 1000;
}



static Cus_Flash_State_t 
Cus_Flash_WaitBusy( uint32_t timeout_ms )
{
	uint32_t start = CUS_FLASH_GET_TICK();
	while( FLASH->SR & FLASH_SR_BSY_Msk )
	{
		if ( (CUS_FLASH_GET_TICK() - start) >= timeout_ms )
		{
			return CUS_FLASH_TIMEOUT;
		}
		__nop();
	}

	#if (DEVICE_STM32F4xx)
		static const uint32_t errorMask = FLASH_SR_PGAERR_Msk | FLASH_SR_PGPERR_Msk | FLASH_SR_PGSERR_Msk | FLASH_SR_WRPERR_Msk;
	#else
		static const uint32_t errorMask = FLASH_SR_PGERR_Msk | FLASH_SR_WRPRTERR_Msk;
	#endif /* DEVICE_STM32F4xx */

	if ( FLASH->SR & FLASH_SR_BSY_Msk ) return CUS_FLASH_TIMEOUT;

	if ( FLASH->SR & errorMask ) 
	{
		/* Clear error flag and return. */
		FLASH->SR |= errorMask;
		return CUS_FLASH_ERROR;
	}

	return CUS_FLASH_OK;
}



Cus_Flash_State_t 
Cus_Flash_WriteBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Buffer_Size )
{
	/* Check if the parameter is valid. */
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Buffer_Size == 0 )   
		return CUS_FLASH_PARAMETER;

	if ( (StartAddress & 0x01UL) )   
	{
		/* The Addr must aligned to half-word. */
		return CUS_FLASH_ALIGNED_ERR;
	}

	Cus_Flash_State_t hReturn =  Cus_Flash_WaitBusy(50);
	if ( hReturn != CUS_FLASH_OK )
	{
		/* The BUS is still busy. Return. */
		return hReturn;
	}

	/* Low voltage state not recovered. Erase operation not allowed. */
	if ( gs_lowVoltage )
		return CUS_FLASH_LOW_VOLTAGE_ERR;

	/* Take Semaphore.(If in RTOS environment.) */
	bool isTake = __sys_takeSemaphore();
	if ( !isTake )
	{
		/* Failed to acquire mutex. Return. */
		return CUS_FLASH_MUTEX_ERR;
	}

	Cus_Flash_Unlock();

	/* Set FLASH_CR PG Bit. */
	FLASH->CR |= FLASH_CR_PG_Msk;

	#if (DEVICE_STM32F4xx)
		/* If the Device is F4 serial. Set FLASH_CR PSIZE Bits. (x16) */
		FLASH->CR = ((FLASH->CR & ~FLASH_CR_PSIZE_Msk) | (0x01UL << FLASH_CR_PSIZE_Pos));
	#endif /* DEVICE_STM32F4xx */

	/* hWordCount is always rounded up to an even number.  */
	uint32_t hWordCount = ((Buffer_Size + 1) / 2);

	volatile uint16_t *flash = (volatile uint16_t *)StartAddress;
	for( uint32_t index = 0; index < hWordCount; index++ )
	{
		uint16_t hw;
		if ( (index == hWordCount - 1) && ((Buffer_Size & 0x01UL) != 0) )
		{
			/* Size is odd. Handle the last half-word separately. */
			hw = pData[index * 2] | 0xFF00UL;
		}
		else 
		{
			/* Normal half-word case. */
			hw = ((uint16_t)pData[index * 2] | ((uint16_t)pData[index * 2 + 1] << 8));
		}

		*flash++ = hw;
		hReturn = Cus_Flash_WaitBusy(50);
		if ( hReturn != CUS_FLASH_OK )
		{
			/* Reset FLASH_CR. Return. */
			FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
			__sys_giveSemaphore();
			Cus_Flash_Lock();
			return hReturn;
		}
	}

	if ( !Cus_Flash_VerifyBuffer(StartAddress, pData, Buffer_Size) )
	{
		/* Verify error. Inform upper layer and return. */
		FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
		__sys_giveSemaphore();
		Cus_Flash_Lock();
		Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Buffer_Size);
		return CUS_FLASH_VERIFY_ERR;
	}

	FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
	Cus_Flash_Lock();
	__sys_giveSemaphore();
	return CUS_FLASH_OK;
}



bool 
Cus_Flash_VerifyBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Size )
{
	/* Check if the parameter is valid. */
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Size == 0 )  
		return false;

	if ( !(StartAddress & 0x03UL) && !(Size % 4) && !((uint32_t)pData & 0x03UL) )
	{
		/*  4-byte aligned. Use word access for faster verification. */
		uint32_t *flash = (uint32_t *)StartAddress;
		uint32_t *pSrc = (uint32_t *)pData;
		for( uint32_t index = 0; index < (Size / 4); index++ )
		{
			if ( *flash++ != *pSrc++ )
			{
				/* Verification failed. Word mismatch detected. */
				Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Size);
				return false;
			}
		}
	}
	else 
	{
		/* Not 4-byte aligned. Fall back to byte-by-byte verification.  */
		for( uint32_t i = 0; i < Size; i++ )
		{
			if ( *((uint8_t *)StartAddress + i) != pData[i] )   
			{
				/* Verification failed. Byte mismatch detected. */
				Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Size);
				return false;
			}
		}
	}

	return true;
}



bool 
Cus_Flash_IsValid( uint32_t StartAddress, uint32_t Size )
{
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || Size == 0 )  
		return false;

	if ( !(StartAddress & 0x03UL) && !(Size % 4) )
	{
		/* 4-byte aligned. Use x32 for faster action. */
		uint32_t *flash = (uint32_t *)StartAddress;
		for( uint32_t index = 0; index < (Size / 4); index++ )
		{
			if ( *flash++ != UINT32_MAX )
			{
				/* Area is not all 0xFF (not erased). May contain existing data. Mark as unavailable and return. */
				return false;
			}
		}
	}
	else 
	{
		/* Not 4-byte aligned. Fall back to byte-by-byte verification. */
		for( uint32_t i = 0; i < Size; i++ )
		{
			if ( *((uint8_t *)StartAddress + i) != UINT8_MAX )   
			{
				return false;
			}
		}
	}

	return true;
}



Cus_Flash_State_t 
Cus_Flash_PVDConfig( Cus_Flash_PVD_t PVDLevel )
{
	/* Check if the PVDLEvel valid. */
	if ( PVDLevel > CUS_FLASH_PVD_LEVEL7 )
		return CUS_FLASH_PARAMETER;

	/* Set PWR_CR PLS Bits. */
	PWR->CR |= (PVDLevel << PWR_CR_PLS_Pos);

	/* Enable PVD NVIC and set priority. */
	NVIC_EnableIRQ(PVD_IRQn);
	NVIC_SetPriority(PVD_IRQn, 0);

	return CUS_FLASH_OK;
}



void 
Cus_Flash_PVDSet( void )
{
	/* If PVD is enabled, place this API in the PVD ISR. */
	gs_lowVoltage = 1;
}



void 
Cus_Flash_PVDClr( void )
{
	/* Clear the PVD low voltage flag. */
	gs_lowVoltage = 0;
}



#if defined(FLASH_TYPEERASE_PAGES) && (DEVICE_STM32F1xx)

