R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
		return NULL;
	}



	const Cus_Flash_Sector_t *
	Cus_Flash_GetSectorbyIndex( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return NULL;

		return (const Cus_Flash_Sector_t *)&SectorTable[Index];
	}



	uint8_t 
	Cus_Flash_GetTotalSectors( void )
	{
		return gsc_secTotalCount;
	}



	uint32_t 
	Cus_Flash_GetSectorSize( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return 0;

		return SectorTable[Index].secSize;
	}



	uint8_t 
	Cus_Flash_GetRemainSectors( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return 0;

		return ((gsc_secTotalCount - 1) - Index);
	}



	void 
	Cus_Flash_EnableART( void )
	{
		uint32_t acrReg = FLASH->ACR;
		uint32_t currentHCLK = SystemCoreClock;
		if ( (currentHCLK > SYSTEMCLOCK_60Mhz) && ((acrReg & FLASH_ACR_LATENCY_Msk) < 2) )
		{
			/* Wrong ACR LATENCY Config.Refuse to enable ART. */
			Cus_FLASH_ARTEnableFailed_Hook(acrReg);
			return;
		}

		if ( (acrReg & FLASH_ACR_PRFTEN_Msk) && (acrReg & FLASH_ACR_ICEN_Msk) && (acrReg & FLASH_ACR_DCEN_Msk) )
		{
			/* ART Accelerator has been Enabled. */
			return;
		}

		/* Enable Flash prefetch buffer and instruction cache (PRFTEN & ICEN & DCEN). */
		FLASH->ACR |= (FLASH_ACR_PRFTEN_Msk | FLASH_ACR_ICEN_Msk | FLASH_ACR_DCEN_Msk);
		__DSB();

		/* Check if the config has been written. */
		if ( !(FLASH->ACR & FLASH_ACR_PRFTEN_Msk) || !(FLASH->ACR & FLASH_ACR_ICEN_Msk) || !(FLASH->ACR & FLASH_ACR_DCEN_Msk) )
		{
			/* Something error happend? inform the upper layer. */
			Cus_FLASH_ARTEnableFailed_Hook(FLASH->ACR);
			return;
		}

		/* Success. Normal back. */
	}



	Cus_Flash_State_t 
	Cus_Flash_EraseSector( const Cus_Flash_Sector_t *pSector )
	{
		if ( !pSector )		return CUS_FLASH_PARAMETER;		/* Invalid parameter. */

		uint32_t start = CUS_FLASH_GET_TICK();
		while( FLASH->SR & FLASH_SR_BSY_Msk )
		{
			if ( (CUS_FLASH_GET_TICK() - start) >= 300 ) break;
			__nop();
		}
		if ( FLASH->SR & FLASH_SR_BSY_Msk )
		{
			/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
			Cus_FLASH_EraseSectorFailed_Hook(pSector);
			return CUS_FLASH_BUSY;
		}

		/* Low voltage state not recovered. Erase operation not allowed. */
		if ( gs_lowVoltage )
			return CUS_FLASH_LOW_VOLTAGE_ERR;

		bool isTake = __sys_takeSemaphore();
		if ( !isTake )
		{
			return CUS_FLASH_MUTEX_ERR;
		}

		Cus_Flash_Unlock();

		/* Set FLASH_CR SER bit. */
		FLASH->CR |= FLASH_CR_SER_Msk;

		uint32_t snbVal = 0;
		switch (gsc_secTotalCount)
		{
			/* Directly write secIndex to SNB. For 12-sector devices, indices 0~11 map 1:1 to hardware encoding. */ 
			case 6:
			case 8:
			case 12:	snbVal = pSector->secIndex;	break;

			/* Physical sectors 12~23 map to SNB values 16~27 (offset +4), because SNB 12~15 are reserved. */ 
			case 24:	snbVal = (pSector->secIndex >= 12) ? (pSector->secIndex + 4) : (pSector->secIndex);	  break;

			/* Unexpected sector index. Notify upper layer via hook and return. */
			default:	goto ERROR;
		}

		__enter_critical();
		/* Write SectorIndex which waiting for erasing to FLASH_CR SNB. */
		FLASH->CR |= (snbVal << FLASH_CR_SNB_Pos);

		/* Set FLASH_CR STRT bit. */
		FLASH->CR |= FLASH_CR_STRT_Msk;
		__exit_critical();

		/* Wait for BSY to clear (erase finished). */
		{
			uint32_t start = CUS_FLASH_GET_TICK();
			while( FLASH->SR & FLASH_SR_BSY_Msk )
			{
				if ( (CUS_FLASH_GET_TICK() - start) >= 3000 ) break;
				__nop();
			}
			if ( FLASH->SR & FLASH_SR_BSY_Msk )
			{
				/* Error! BSY clear timeout. */
				goto ERROR;
			}
		}

		/* Normal back. */
		__sys_giveSemaphore();
		Cus_Flash_Lock();
		return CUS_FLASH_OK;

	ERROR:
		__sys_giveSemaphore();
		Cus_Flash_Lock();
		Cus_FLASH_EraseSectorFailed_Hook(pSector);
		return CUS_FLASH_ERROR;
	}



	uint8_t 
	Cus_Flash_EraseSectors( const Cus_Flash_Sector_t *pSector, uint8_t eNum )
	{
		if ( !pSector || !eNum )		return 0;

		uint8_t Remain = Cus_Flash_GetRemainSectors(pSector->secIndex);
		if ( eNum > (Remain + 1) )
		{
			/* Requested erase count exceeds remaining sectors. Return. */
			return 0;
		}

		/* Erasing multiple sectors. */
		Cus_Flash_State_t hReturn = CUS_FLASH_OK;
		uint8_t offset = 0;
		uint8_t waitErased = eNum;
		while( (hReturn == CUS_FLASH_OK) && waitErased-- )
		{
			const Cus_Flash_Sector_t *currentSec = Cus_Flash_GetSectorbyIndex(pSector->secIndex + offset++);
			hReturn = Cus_Flash_EraseSector(currentSec);
		}
		if ( (waitErased != 0) && (hReturn != CUS_FLASH_OK) )
		{
			/* Something error happend while erasing.Return with Successfully erased count. */
			return (eNum - waitErased);
		}

		/* Successfully erased all sectors. Normal back. */
		return eNum;
	}



	Cus_Flash_State_t 
	Cus_Flash_WriteSector( const Cus_Flash_SecReq_t *pRequest )
	{
		if ( !pRequest || !pRequest->pBuffer || !pRequest->bufSize || !pRequest->pSector )	
			return CUS_FLASH_PARAMETER;

		if ( ((pRequest->pSector->secStartAddr + pRequest->Offset) & 0x03) != 0 )
		{
			/* StartAddr + Offset must aligned to 4 Bytes. */
			return CUS_FLASH_ALIGNED_ERR;
		}

		/* Verify that write size does not exceed the current sector boundary.  */
		#if (CUS_FLASH_USE_MANAGER)
			if ( (pRequest->Offset + sizeof(desc_t) + pRequest->bufSize) > pRequest->pSector->secSize )
		#else
			if ( (pRequest->Offset + pRequest->bufSize) > pRequest->pSector->secSize )
		#endif
		return CUS_FLASH_PARAMETER;

		uint32_t start = CUS_FLASH_GET_TICK();
		while( FLASH->SR & FLASH_SR_BSY_Msk )
		{
			if ( (CUS_FLASH_GET_TICK() - start) >= 300 ) break;
			__nop();
		}
		if ( FLASH->SR & FLASH_SR_BSY_Msk )
		{
			/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
			return CUS_FLASH_BUSY;
		}

		/* Low voltage state not recovered. Erase operation not allowed. */
		if ( gs_lowVoltage )
			return CUS_FLASH_LOW_VOLTAGE_ERR;

		bool isTake = __sys_takeSemaphore();
		if ( !isTake )
		{
			return CUS_FLASH_MUTEX_ERR;
		}

		/* Check. Whether the program region valid to be written. */
		uint32_t waitCheckBytes;
		#if (CUS_FLASH_USE_MANAGER)
			waitCheckBytes = sizeof(desc_t) + pRequest->bufSize;
		#else 
			waitCheckBytes = pRequest->bufSize;
		#endif /* CUS_FLASH_USE_MANAGER */

		uint8_t *pData = (uint8_t *)(pRequest->pSector->secStartAddr + pRequest->Offset);
		if ( waitCheckBytes <= CUS_CHECK_THRESHOLD )
		{
			/* Full exhaustive check for small block size (≤ CUS_CHECK_THRESHOLD). */
			for( uint32_t count = 0; count < waitCheckBytes; count++ )
			{
				if ( pData[count] != 0xFF )
				{
					/* 
						Target area not fully erased (non-0xFF detected). Reject write to prevent data corruption.
						Notify upper layer, and return. 
					*/
					goto NOT_ERASED;
				}
			}
		}
		else 
		{
			/* Sparse spot check: sample first 4B, last 4B, and every 128B in between. */
			/* First 4 Bits Check. */
			for ( uint8_t i = 0; i < 4; i++ )
				if ( pData[i] != 0xFF )  goto NOT_ERASED;		
			
