R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
		/* Check for overlapping regions in the managed memory area. */
		for( uint8_t index = 0; index < gs_ActivateCount; index++ )
		{
			FlashMgr_Instance_t *other = gs_ActivateMgr[index];
			if ( (start_addr < other->mgrEndAddr) && (other->mgrStartAddr < end_addr) )
			{
				/* Overlapping managed region detected with an existing instance. Return. */
				return CUS_FLASH_OVERLAP_ERR;
			}
		}
		
		/* Init the gs_recordCount and gs_lowestFreeAddr. */
		instance->mgrRecordCount = 0;
		instance->mgrLowestFreeAddr = 0;

		/* Scan the entire managed area for valid data. */
		/* Start address and size are 4-byte aligned. Access as 32-bit words (size/4), no tail bytes. */
		uint32_t scanCount_W = ((end_addr - start_addr) / 4);
		uint32_t *flash = (uint32_t *)start_addr;
		uint16_t totalCnt = FLASH_MGR_MAX_RECORDS;
		uint8_t flash_step = (sizeof(desc_t) / 4);
		#define UINT_TO_DESC	((desc_t *)flash)	

		for( uint32_t index = 0; index < scanCount_W; index++ )
		{
			if ( (*flash == CUS_MANAGER_MAGIC) && (UINT_TO_DESC->validFlag == 0xF0F0UL) )
			{
				if ( instance->mgrRecordCount >= FLASH_MGR_MAX_RECORDS )
				{
					/* Error. Buffer Overflow. */
					totalCnt++;
					flash += flash_step;
					index += (flash_step - 1);
					continue;
				}

				/* Find one valid record. add to Recored Poll(gs_records). */
				FlashMgr_Record_t record;
				record.msgStartAddr = UINT_TO_DESC->dataStartAddr;
				record.msgSize = UINT_TO_DESC->Size;
				record.msgType = UINT_TO_DESC->Type;
				memcpy(record.msgDetail, UINT_TO_DESC->Desc, sizeof(record.msgDetail));

				memcpy(&instance->mgrRecords[instance->mgrRecordCount++], &record, sizeof(FlashMgr_Record_t));

				if ( (uint32_t)flash + (sizeof(desc_t) + UINT_TO_DESC->Size) > end_addr )
				{
					/* Parsed data would cause out-of-bounds flash access. Return error. */
					return CUS_FLASH_ERROR;
				}

				uint32_t userWords = ((UINT_TO_DESC->Size + 3) / 4);
				flash += flash_step + userWords;

				/*
					Note: Due to zero-based index increment in the for loop, 
					the valid offset within this step is (flash_step - 1), not flash_step. 
				*/
				index += (flash_step - 1) + userWords;	

				continue;
			}

			if ( (*flash == 0xFFFFFFFFUL) )
			{
				/* Possibly the start address of the free area. Verify further. */
				uint32_t storeAddr = (uint32_t)flash;
				uint32_t *pOperation = flash;
				bool isFree = true;
				for( uint8_t cnt = 0; cnt < ((sizeof(desc_t) / 4) + 4); cnt++ )
				{
					/* Candidate free area found. Verify that the following (sizeof(desc_t) / 4 + 4) words are all 0xFFFF. */
					/* In order to ensure that the free area has enough capacity for one control header and at least 4 words of user data. */
					if ( *pOperation != 0xFFFFFFFFUL )	
					{
						/* Detected non-0xFF. Continue. */
						isFree = false;
						break;
					}

					pOperation++;
				}

				/* Free area found. Store address and return. */
				if ( isFree )
				{
					instance->mgrLowestFreeAddr = storeAddr;
					break;
				}
			}

			/* Neither free area nor valid record. Treat as invalid data and skip. */
			flash++;
		}

		if ( totalCnt > FLASH_MGR_MAX_RECORDS )
		{
			/* Inform the upper layer that the Recored Poll overflow. */
			#undef UINT_TO_DESC
			Cus_FLASH_MGRBufOVFL_Hook(totalCnt);
			return CUS_FLASH_OVFLW_ERR;
		}

		if ( !instance->mgrLowestFreeAddr )
		{
			/* No free area found after full scan. Mark as full. */
			instance->mgrLowestFreeAddr = end_addr;
		}

		instance->mgrStartAddr = start_addr;
		instance->mgrEndAddr = end_addr;

		/* Add this instance to gs_ActivateMgr. */
		gs_ActivateMgr[gs_ActivateCount++] = instance;

		#undef UINT_TO_DESC
		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_Append( FlashMgr_Instance_t *instance, const Cus_FlashMgr_Req_t *pReq )
	{
		if ( !pReq || !pReq->DataBuff || !pReq->DataSize || !instance )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;
		
		/* Check if the FreeSpace is enough. */
		if ( !instance->mgrLowestFreeAddr || (instance->mgrLowestFreeAddr == instance->mgrEndAddr) )
			return CUS_FLASH_NOSPACE_ERR;

		/* Check if the requested data size exceeds the remaining space.  */
		if ( (pReq->DataSize + sizeof(desc_t)) > (instance->mgrEndAddr - instance->mgrLowestFreeAddr) )
			return CUS_FLASH_NOSPACE_ERR;

		/* Check if the Record-Poll have free space. */
		if ( instance->mgrRecordCount >= FLASH_MGR_MAX_RECORDS )
			return CUS_FLASH_OVFLW_ERR;

		/* Constract the write request pack. */
		#if (DEVICE_STM32F4xx)
			Cus_Flash_SecReq_t package;
		#else 
			Cus_Flash_PageReq_t package;
		#endif /* DEVICE_STM32F4xx */

		package.dataType = (uint16_t)pReq->DataType;
		package.bufSize = pReq->DataSize;
		package.pBuffer = pReq->DataBuff;
		package.Offset = (instance->mgrLowestFreeAddr - instance->mgrStartAddr);
		memcpy(package.desc, pReq->DataDesc, sizeof(package.desc));

		#if (DEVICE_STM32F4xx)
			/* If the device is F4xx serial. Get the Sector. */
			const Cus_Flash_Sector_t *Sector = Cus_Flash_GetSectorbyAddr(instance->mgrStartAddr);
			if ( !Sector )
			{
				/* Oops! NULL ptr? Return Error. */
				return CUS_FLASH_ERROR;
			}
			package.pSector = Sector;

			/* Append record. */
			Cus_Flash_State_t hReturn = Cus_Flash_WriteSector(&package);
			if ( hReturn != CUS_FLASH_OK )
				return hReturn;
		#endif /* DEVICE_STM32F4xx */

		#if (DEVICE_STM32F1xx)
			/* Construct the Control block. */
			desc_t desc;
			desc.dataStartAddr = instance->mgrLowestFreeAddr + sizeof(desc_t);
			desc.Magic = CUS_MANAGER_MAGIC;
			desc.Size = package.bufSize;
			desc.Type = package.dataType;
			desc.validFlag = 0xFFFFUL;
			memcpy(desc.Desc, package.desc, sizeof(desc.Desc));

			/* Write the control block. */
			Cus_Flash_State_t hReturn = Cus_Flash_WriteBuffer(instance->mgrLowestFreeAddr, (uint8_t *)&desc, sizeof(desc_t));
			if ( hReturn != CUS_FLASH_OK )
				return hReturn;

