R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
			/* Write the User data. */
			hReturn = Cus_Flash_WriteBuffer((instance->mgrLowestFreeAddr + sizeof(desc_t)), package.pBuffer, package.bufSize);
			if ( hReturn != CUS_FLASH_OK )
				return hReturn;

			/* Write the true validFlag(Commit). */
			uint16_t commit = 0xF0F0UL;
			hReturn = Cus_Flash_WriteBuffer(instance->mgrLowestFreeAddr + offsetof(desc_t, validFlag), (uint8_t *)&commit, sizeof(commit));
			if ( hReturn != CUS_FLASH_OK )
				return hReturn;
		#endif /* DEVICE_STM32F1xx */

		/* Update the Records Poll. */
		FlashMgr_Record_t Record = 
		{
			.msgSize = package.bufSize,
			.msgStartAddr = (instance->mgrStartAddr + package.Offset + sizeof(desc_t)),
			.msgType = package.dataType,
			.msgDetail = {0}
		};
		memcpy(Record.msgDetail, package.desc, sizeof(Record.msgDetail));
		instance->mgrRecords[instance->mgrRecordCount++] = Record; 

		/* Update the lowestFreeAddr. */
		instance->mgrLowestFreeAddr += sizeof(desc_t) + package.bufSize;

		/* Align to the next word boundary. */
		if ( (instance->mgrLowestFreeAddr & 0x03) )
			instance->mgrLowestFreeAddr = (instance->mgrLowestFreeAddr + 3) & ~0x03;

		if ( instance->mgrLowestFreeAddr >= instance->mgrEndAddr )
			instance->mgrLowestFreeAddr = instance->mgrEndAddr;

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_GetRecordByDesc( FlashMgr_Instance_t *instance, const char *desc, Cus_Flash_desc_t *pOut )
	{
		if ( !desc || !pOut || !instance )	
			return CUS_FLASH_PARAMETER;

		/* Match the specified Records. Newest record first. */
		FlashMgr_Record_t *best = NULL;
		uint32_t idx = 0;
		for( int16_t index = (int16_t)(instance->mgrRecordCount - 1); index >= 0; index-- )
		{
			if ( (strncmp(instance->mgrRecords[index].msgDetail, desc, sizeof(instance->mgrRecords[index].msgDetail)) == 0) )
			{
				if ( !best || instance->mgrRecords[index].msgStartAddr > best->msgStartAddr )
				{
					/* Ensure the latest message is retrieved. */
					best = &instance->mgrRecords[index];
					idx = index;
				}
			}
		}

		if ( best )
		{
			/* Matched the specific Records. Return to user. */
			Cus_Flash_desc_t user;
			user.dataType 		 = best->msgType;
			user.dataStartAddr 	 = best->msgStartAddr;
			user.dataSize 		 = best->msgSize;
			user.dataIndexInPoll = idx;
			memcpy(user.dataDesc, best->msgDetail, sizeof(user.dataDesc));

			*pOut = user;
			return CUS_FLASH_OK;
		}

		/* Record not found. */
		return CUS_FLASH_NOT_FOUND;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DeleteByIndex( FlashMgr_Instance_t *instance, uint32_t recordIndex )
	{
		/* Check if the recordIndex valid. */
		if ( !instance || (recordIndex >= instance->mgrRecordCount) )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		/* Change the validFlag in Flash for this record to invalid. */
		uint32_t controlBlockAddr = (instance->mgrRecords[recordIndex].msgStartAddr - sizeof(desc_t));
		uint32_t validFlagAddr_inFlash = controlBlockAddr + offsetof(desc_t, validFlag);
		uint16_t delFlag = 0xF0E0UL;	

		Cus_Flash_State_t hReturn = Cus_Flash_WriteBuffer(validFlagAddr_inFlash, (uint8_t *)&delFlag, sizeof(delFlag));
		if ( hReturn != CUS_FLASH_OK )
		{
			/* Flash write error. Return. */
			return hReturn;
		}

		/* Use the tail data filling the holes that cased by delete operating. */
		instance->mgrRecords[recordIndex] = instance->mgrRecords[instance->mgrRecordCount - 1];
		instance->mgrRecordCount--;

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DeleteByDesc( FlashMgr_Instance_t *instance, const char *desc )
	{
		if ( !desc || !instance )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		/* Get record via desc. */
		Cus_Flash_desc_t descOut = { 0 };
		if ( Cus_FlashMgr_GetRecordByDesc(instance, desc, &descOut) != CUS_FLASH_OK )
		{
			/* Not find the relavent record. Return. */
			return CUS_FLASH_NOT_FOUND;
		}

		/* Delete record via Index. */
		Cus_Flash_State_t hReturn = Cus_FlashMgr_DeleteByIndex(instance, descOut.dataIndexInPoll);

		return hReturn;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_GetRecordCount( FlashMgr_Instance_t *instance, uint16_t *pOut )
	{
		if ( !instance || !pOut )
			return CUS_FLASH_PARAMETER;

		*pOut = instance->mgrRecordCount;

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_GetFreeSpace( FlashMgr_Instance_t *instance, uint32_t *pOut )
	{
		if ( !instance || !pOut )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		uint32_t Remain = (instance->mgrEndAddr - instance->mgrLowestFreeAddr);
		if ( Remain < sizeof(desc_t) )
		{
			/* Not enough space left for the next control head. */
			/* Return no free space left though there are some space hard to use. */
			*pOut = 0;
		}
		else 
		{
			/* Return the available user data size(excluding the control header). */
			*pOut = (Remain - sizeof(desc_t));
		}

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_EraseRegion( FlashMgr_Instance_t *instance )
	{
		if ( !instance )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		#if (DEVICE_STM32F4xx)
			const Cus_Flash_Sector_t *Sector = Cus_Flash_GetSectorbyAddr(instance->mgrStartAddr);
			if ( !Sector )
			{
				/* Not found relavent sector. Return. */
				return CUS_FLASH_NOT_FOUND;
			}

			/* Erase the Manager-Controll sector. */
			Cus_Flash_State_t hReturn = Cus_Flash_EraseSector(Sector);
			if ( hReturn != CUS_FLASH_OK )
			{
				/* Erase failed! Return. */
				return hReturn;
			}
		#endif /* DEVICE_STM32F4xx */

