R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
		#if (DEVICE_STM32F1xx)
			int16_t startPage = Cus_Flash_GetPageIndex(instance->mgrStartAddr);
			int16_t endPage = Cus_Flash_GetPageIndex(instance->mgrEndAddr - 1);
			if ( (startPage < 0) || (endPage < 0) )
				return CUS_FLASH_ERROR;
			
			int16_t eraseCount = endPage - startPage + 1;
			if ( Cus_Flash_ErasePages(Cus_Flash_GetPageAddress(startPage), eraseCount) != eraseCount )
				return CUS_FLASH_ERROR;
		#endif /* DEVICE_STM32F1xx */

		/* Reset the states. */
		instance->mgrRecordCount = 0;
		instance->mgrLowestFreeAddr = instance->mgrStartAddr;

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DeInit( FlashMgr_Instance_t *instance )
	{
		if ( !instance )
			return CUS_FLASH_PARAMETER;

		/* Traverse the manager table to find the index for this instance. */
		for( int16_t index = (int16_t)(gs_ActivateCount - 1); index >= 0; index-- )
		{
			if ( gs_ActivateMgr[index] == instance )
			{
				/* Find the relavent instance. Delete. */
				gs_ActivateMgr[index] = gs_ActivateMgr[(gs_ActivateCount - 1)];
				gs_ActivateCount--;

				/* Reset the states. */
				instance->mgrEndAddr = 0;
				instance->mgrLowestFreeAddr = 0;
				instance->mgrStartAddr = 0;

				return CUS_FLASH_OK;
			}
		}

		/* Not Found. Return. */
		return CUS_FLASH_NOT_FOUND;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DeleteAllByDesc( FlashMgr_Instance_t *instance, const char *desc, uint16_t *delCnt )
	{
		if ( !instance || !instance->mgrStartAddr || !instance->mgrEndAddr || !desc )
			return CUS_FLASH_PARAMETER;

		uint16_t deleted = 0;
		Cus_Flash_desc_t Out;

		/* O(n^2) complexity, but acceptable since the record count is small. */
		while( Cus_FlashMgr_GetRecordByDesc(instance, desc, &Out) == CUS_FLASH_OK )
		{
			/* Relavent records still exist. Continue deletion.  */
			Cus_Flash_State_t hReturn = Cus_FlashMgr_DeleteByIndex(instance, Out.dataIndexInPoll);
			if ( hReturn != CUS_FLASH_OK )
			{
				/* Delete Err. Return. */
				return hReturn;
			}

			/* Successful delete this record. Continue. */
			deleted++;

			if ( delCnt )	*delCnt = deleted;
		}

		/* Has been deleted all relavent records. */
		return (deleted ? CUS_FLASH_OK : CUS_FLASH_NOT_FOUND);
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DumpByDesc( FlashMgr_Instance_t *instance, const char *desc, Cus_Flash_PrintCB pcallback )
	{
		if ( !instance || !pcallback || !desc )
			return CUS_FLASH_PARAMETER;

		/* Print the table header first. */
		pcallback(" Idx Type  Size  FlashAddr   Desc");
		pcallback("-------------------------------------------");

		uint16_t outPutMask[FLASH_MGR_MAX_RECORDS] = { 0 };
		char buffer[64] = { 0 };
		uint16_t total = 0;
		for( uint16_t i = 0; i < instance->mgrRecordCount; i++ )
		{
			uint32_t bestAddr = 0;
			uint32_t bestIdx = 0;
			bool found = false;

			for( uint16_t j = 0; j < instance->mgrRecordCount; j++ )
			{
				/* This entry has already been processed. Skip. */
				if ( outPutMask[j] )
					continue;

				/* Check if the desc not match. Continue. */
				if ( strncmp(desc, instance->mgrRecords[j].msgDetail, 16) != 0 )	
					continue;
				
				/* Find the record entry matching the Desc, and check if its address exceeds the current maximum. */
				if ( instance->mgrRecords[j].msgStartAddr > bestAddr )
				{
					bestAddr = instance->mgrRecords[j].msgStartAddr;
					bestIdx = j;
					found = true;
				}
			}

			total++;
			/* Has no matched records. Break.*/
			if ( !found )	break;

			/* Process this matched entries. */
			outPutMask[bestIdx] = 1;
			FlashMgr_Record_t *Record = &instance->mgrRecords[bestIdx];
			snprintf(buffer, sizeof(buffer), "%3u %3u  %5lu   0x%08lX  %-16s",
						total, Record->msgType, Record->msgSize, Record->msgStartAddr, Record->msgDetail);

			pcallback(buffer);
			memset(buffer, 0, sizeof(buffer));
		}

		/* Print the table tail. */
		pcallback("-------------------------------------------");

		uint32_t freeBytes = 0;
		Cus_FlashMgr_GetFreeSpace(instance, &freeBytes);

		snprintf(buffer, sizeof(buffer), " Free: %lu bytes  |  Records: %u\n\n",
					(unsigned long)freeBytes, (unsigned int)total);
		pcallback(buffer);

		return CUS_FLASH_OK;
	}

	

	Cus_Flash_State_t 
	Cus_FlashMgr_DumpAll( FlashMgr_Instance_t *instance, Cus_Flash_PrintCB pcallback )
	{
		if ( !instance || !pcallback )
			return CUS_FLASH_PARAMETER;

		/* Print the table header first. */
		pcallback(" Idx Type  Size  FlashAddr   Desc");
		pcallback("-------------------------------------------");

		char buffer[64] = { 0 };
		for( uint16_t i = 0; i < instance->mgrRecordCount; i++ )
		{
			FlashMgr_Record_t *Record = &instance->mgrRecords[i];
			snprintf(buffer, sizeof(buffer), "%3u %3u  %5lu   0x%08lX  %-16s",
						(unsigned int)(i + 1), (unsigned int)Record->msgType,
						(unsigned long)Record->msgSize,
						(unsigned long)Record->msgStartAddr, Record->msgDetail);

			pcallback(buffer);
			memset(buffer, 0, sizeof(buffer));
		}

		/* Print the table tail. */
		pcallback("-------------------------------------------");

		uint32_t freeBytes = 0;
		Cus_FlashMgr_GetFreeSpace(instance, &freeBytes);

		snprintf(buffer, sizeof(buffer), " Free: %lu bytes  |  Records: %u\n\n",
					(unsigned long)freeBytes, (unsigned int)instance->mgrRecordCount);
		pcallback(buffer);

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_Compact( FlashMgr_Instance_t *instance, Cus_Flash_KeepCB cb, void *ctx, uint8_t *backBuf, uint32_t bufSize )
	{
		/* Check if the instance is valid. */
		if ( !instance || !instance->mgrStartAddr )
			return CUS_FLASH_PARAMETER;

		/* Parameter check. */
		if ( !backBuf || !cb || bufSize < sizeof(FlashMgr_Record_t) )
			return CUS_FLASH_PARAMETER;

		/* Create an index array for the entries to keep. */
		int16_t backIndexArr[FLASH_MGR_MAX_RECORDS] = { -1 };
		static CompactMeta backMeta[FLASH_MGR_MAX_RECORDS] = { 0 };
		uint16_t backCount = 0;

		for( uint16_t index = 0; index < instance->mgrRecordCount; index++ )
		{
			/* Invoke user callback to determine which entries should be retained. */
			bool isRetained = cb(&instance->mgrRecords[index], ctx);
			if ( isRetained )
			{
				/* This entries should be retained. */
				if ( backCount >= FLASH_MGR_MAX_RECORDS )
					return CUS_FLASH_OVFLW_ERR;
				backIndexArr[backCount++] = index;
			}
		}

		/* Check if the retention list has entries. If so, proceed with backup. */
		if ( backCount )
		{
			uint8_t *pUser = backBuf;

			for( uint16_t index = 0; index < backCount; index++ )
			{
				if ( backIndexArr[index] < 0 )  continue;

				FlashMgr_Record_t *rec = &instance->mgrRecords[backIndexArr[index]];

				if ( (uint32_t)(pUser - backBuf) + rec->msgSize > bufSize )
					return CUS_FLASH_NOSPACE_ERR;

				/* Save the user data. */
				memcpy(pUser, (const void *)(uintptr_t)rec->msgStartAddr, rec->msgSize);

				/* Save the metadata. */
				backMeta[index].size = rec->msgSize;
				backMeta[index].type = rec->msgType;
				memcpy(backMeta[index].desc, rec->msgDetail, sizeof(rec->msgDetail));

				/* Move pUser to the next item. */
				pUser += rec->msgSize;
			}
		}

		/* Erase the entire managed area. */
		Cus_Flash_State_t hReturn = Cus_FlashMgr_EraseRegion(instance);
		if ( hReturn != CUS_FLASH_OK )
			return hReturn;	
		
		/* Write back the retained entries in append mode one by one. */
		uint8_t *pBuf = backBuf;
		Cus_FlashMgr_Req_t Req = { 0 };
		for( uint16_t index = 0; index < backCount; index++ )
		{     
			Req.DataBuff = pBuf;
			pBuf += backMeta[index].size;

			Req.DataSize = backMeta[index].size;
			Req.DataType = backMeta[index].type;
			memcpy(Req.DataDesc, backMeta[index].desc, sizeof(Req.DataDesc));

			hReturn = Cus_FlashMgr_Append(instance, &Req);
			if ( hReturn != CUS_FLASH_OK )
				return hReturn;
		}

		return CUS_FLASH_OK;
	}

#endif /* CUS_FLASH_USE_MANAGER */



